import os
import asyncio
import random
from dotenv import load_dotenv
import telebot
from telebot.types import InlineKeyboardMarkup, InlineKeyboardButton, Message, CallbackQuery
from jokeapi import Jokes

# Токен бота
load_dotenv()
token = os.getenv("BOT_TOKEN")
bot = telebot.TeleBot(token)

#
#  Так называетмые вспомогательные функции
#

async def get_jks_from_API(category = 'Any'):
    j = await Jokes()
    json_jokes = await j.get_joke(category=[category], joke_type="single", amount=3)
    return json_jokes

def make_answer_string(head: str, jokes: list[str], tail="🤣🤣🤣") -> str:
    return f'{head}\n\n 1. {jokes[0]}\n\n 2. {jokes[1]}\n\n 3. {jokes[2]}\n\n {tail}'

def find_jokes_in_file() -> list[str]:
    return random.sample(get_lokal_archive(), 3)

def get_inline_keyboard(call_back1: str, call_back2='gmenu') -> InlineKeyboardMarkup:
    return InlineKeyboardMarkup(row_width=2).add(
                        InlineKeyboardButton(text='Еще🤣',
                                             callback_data = call_back1),
                        InlineKeyboardButton(text='←Вернуться в меню',
                                             callback_data = call_back2) )

def add_to_markup(markup: InlineKeyboardMarkup, strings: list[tuple[str,str]]) -> None:
    for text, call_back_data in strings:
        markup.add(InlineKeyboardButton(
            text=text,
            callback_data=call_back_data
        ))

def make_menu(chat_id) -> None:
    # btn_neuro_gen = types.InlineKeyboardButton(text="Сгенерировать шутку с помощью нейросети",
    #                                            callback_data='jokes/neuro')
    markup = InlineKeyboardMarkup(row_width=1)

    surses = [
        ("💎Брильянтовый  архив💎", "lokal"),
        ("💂Английский юмор💂", "apimenu")
    ]

    add_to_markup(markup, surses)

    bot.send_message(chat_id, 'Отличное время для какой-нибудь шутки \n'
                              '🔥У меня есть разные коллекции🔥\n'
                              'Выбери какая больше нравится они все смешные 😆',
                                        reply_markup=markup)

def remove_inline_keyboard(chat_id, message_id) -> None:
    bot.edit_message_reply_markup(
            chat_id,
            message_id,
            reply_markup=None
        )


def get_lokal_archive() -> list[str]:
    return [     "Уборщице тете Клаве, у которой была привычка мыть полы в мужской раздевалке со словами: «Ой, да что я там не видела...», спортсмен из Африки показал, на сколько она заблуждалась.",
                 "Сидят подвыпившие мужики и делятся сокровенным, у кого был секс в самых экстремальных местах значит. У одного в башенном кране на стройке, у другого на дереве в городском парке. В общем, как говорится, всем есть что вспомнить, а мужик один вдруг говорит:\n- А мне жена как-то в автомобиле на ходу минет сделала, вот...\nМужики:\n- И что тут экстремального, такое много у кого было?\nОн:\n- Да понимаете, я машину-то никогда не водил и вообще не умею, у меня только жена за рулём.",
                 "— Алло! Здравствуйте. Я насчёт сарая...\n— Извините, но это ракетная база, вы не туда попали!\n— НЕТ, БЛЯТЬ, ЭТО ВЫ НЕ ТУДА ПОПАЛИ!",
                 "Глаза боятся, а руки делают - сказал онанист, ставя перед собой фотографию крокодила.",
                 "Нашла жена золотую рыбку, рыбка ей говорит:\n— Отпусти меня, и я исполню любое твоё желание!\n— Хочу чтобы муж никогда не говорил слово НЕТ.\n— Готово!\nВозвращается жена домой и говорит мужу:\n— Дорогой, купи мне шубу\n— Пошла нахуй.",
                 "Заходит девушка в секс-шоп. Долго стоит выбирает фаллоимитаторы. Наконец подходит к продавцу:\n— Мне пожалуйста вон тот черненький, вон тот зелененький и еще вон тот красненький.\nПродавец:\n— Черненький и зелененький пожалуйста, а насчет огнетушителя надо с администрацией посоветоваться.",
                 "На работе один из сотрудников замечает, что его сослуживица как-то необычно выглядит: большие удивленные глаза и особо крутые кудри. Набравшись наглости, спрашивает у нее:\n— О, Синди, у тебя новый макияж, отпадный перманент!\n— Да нет, просто вибратор закоротило.",
                 "Блондинка в магазине:\n— Мне нужна теплая шапочка со страпоном.\n— Извините, у нас таких нет.\n— Как нет!? Вот же, на манекене такая шапка!\n— Это называется помпон.",
                 "Едут в купе три девушки. Одна говорит:\n- Я люблю трахаться со спортсменами. Быстро прибежал, быстро трахнул, быстро\nубежал. Вторая:\n- А я - с военными. На счет раз пришел, на счет два трахнул, на счет три ушел.\nТретья:\n- А я люблю трахаться с индейцами. Дети природы. Трахаются как звери.\nТут поезд тормознул. Падает грузин с полки:\n- Разрешите представиться - мастер спорта, майор Чингачгук!",
                 "Рассказывает дед внуку про войну:\n— Захватили в плен немцы, и говорят: со..те или расстреляем!\n— Дед, и ты со..л?!\n— Нет, внучек, меня расстреляли.",
                 "- Ой, какая хорошенькая! Можно погладить, не укусит?\n- Простите, вы точно гинеколог?",
                 "– Мама, а ты знаешь, как бедное животное мучилось, чтобы ты носила эту шубу?\n– Сынок, нельзя так про папу.",
                 "Советский Союз. Судья выходит из зала суда и смеётся. Его спрашивают над чем смеётся, а он ответил, что анекдот смешной услышал.\n- Расскажи.\n- Не могу, сам за него только что 10 лет дал.",
                 "Родительское собрание. Директор:\n— Так вы папа Вовочки Сидорова…\n— Я должен с вами побеседовать об аморальном поведении вашего сына на переменах.\n— Он только и делает, что бегает за девочками!\n— Подумаешь, все нормальные парни в его возрасте бегают за девчонками!\nДиректор:\n— С бензопилой?!",
                 "Учительница:\n— Дети обоснуйте выражение «Родится в рубашке»\nВстает Петя:\n— У меня брат на мотоцикле ехал, попал в аварию, мотоцикл в дребезги, а самому не царапинки в рубашке родился.\nВстает Иван, говорит:\n— У меня отец упал с четвертого этажа и только палец себе сломал, в рубашке родился.\nУчительница:\n— Молодцы ребята, а может кто еще что нибудь скажет?\nВовочка встает:\n— Я тут на днях, шесть таблеток виагры захавал, кота начал искать, а его дома не оказалось. В РУБАШКЕ РОДИЛСЯ!!!",
                 "Холодная война. Две вороны смотрят на запуск американской ядерной ракеты.\nОдна ворона говорит:\n- Взлетит.\nВторая:\n- Не взлетит.\n- Взлетит.\n- Не взлетит.\nРакета взлетела и взорвалась.\n- Накаркала.\n- Служу Советскому Союзу!",
                 "Два негра разговаривают в баре:\n- Ты не замечал, каждый раз, когда трахаешься с белой женщиной, то на глаза вдруг наворачиваются слезы.\n- Да, со мной такое же каждый раз.\n- Как ты думаешь, почему?\n- Думаю, это газовый баллончик.",
                "Сидят в камере заключённые, чифирок по кругу гоняют. Вдруг бряцают ключи, и в камеру заводят старого деда. Видно, что дедок такой не простой, многое в жизни повидал. Его приглашают присесть и чифирнуть с арестантами. Дедок оглядел их внимательным взглядом и говорит:\n- Да я, ребята, из своей кружки попью...\nТе в шоке:\n- Ты чё, дед, под сомнение нас ставишь?\nДед им отвечает:\n- Да нет, вы чё, ребята?! Я тут просто вспомнил, сон мне приснился. Иду я, значит, по пляжу, вижу: лежит девушка обнажённая. Ну, я к ней поближе подошёл, смотрю, и она красавица, и пися у неё такая красивая... Так и манит меня. Я нагнулся и лизнул ей причинное место, а оно внутри такое сладкое-сладкое...\nТут один из зэков не выдерживает и перебивает его:\n- Да не сладкое оно, дед, а солёное...\nДед, многозначительно ухмыляясь:\n- Вот, я и говорю, лучше я из своей кружки попью...",
                "Мороз, ночной лес, дубак - 40 градусов. На поляне стая продрогших волков трясется от холода. Тут вожак стаи говорит:\n- Мужики, у меня хрен совсем окоченел, так ведь можно и потомства лишиться - отмерзнет.\nЕго все дружно поддерживают, мол, и у нас тоже замерзли.\n- Предлагаю, раз такое дело, принять срочные меры для сугрева - вставимхрен друг другу в жопу и таким образом отогреем.\nСтая возмущается, как же так, мы ж не пи... расы, а если увидит кто?\n- Если кто увидит, -отвечает вожак, - порвем, другого выхода нет,потомство в опасности.\nВсе согласились, вставили друг другу - греются.\nВдруг лось мимо идет, увидел он это дело и деру. Стая за ним - догнать!порвать!\nВожак стаи:\n- Стоп, мужики, давайте бежать в ногу, а то это не бег, а ебля какая-тополучается.",
            ]


#
#   Так называетмые rоманды боту
#

@bot.message_handler(commands=['start'])
def cmd_start(message: Message) -> None:
    bot.send_message(message.chat.id, '👋 Привет!\n'
                                            'Я — бот с анекдотами.\n'
                                            'Директор смехотворной смехотворительной организации 😎\n'
                                            'Расскажу анекдоты из разных категорий\n'
                                            'И меня есть анекдот, от которого ты точно рассмеешься\n'
                                            'Хочешь начать? Нажми /menu 😉')



@bot.message_handler(commands=["menu", "help"])
def cmd_menu(message: Message) -> None:
    make_menu(message.chat.id)

#
#   Так называетмые возвратные значения
#

@bot.callback_query_handler(func=lambda call: call.data == 'apimenu')
def callback_api_menu(call: CallbackQuery) -> None:
    bot.delete_message(chat_id=call.message.chat.id, message_id=call.message.id)
    markup = InlineKeyboardMarkup(row_width=1)

    categories = [
        ("💻Программирование", "api/category/Programming"),
        ("😈Черный", "api/category/Dark"),
        ("🎯Каламбур", 'api/category/Pun'),
        ("🎲Разнообразный", "api/category/Misc")
    ]

    add_to_markup(markup, categories)

    bot.send_message(call.message.chat.id, 'Время выбрать категорию 😉', reply_markup=markup)



@bot.callback_query_handler(func=lambda call: call.data.startswith('api/category/'))
def callback_api_send_jokes_by_category(call: CallbackQuery) -> None:
    remove_inline_keyboard(call.message.chat.id, call.message.id)
    category = call.data.split('/')[-1]
    try:
        json_jokes = asyncio.run(get_jks_from_API(category))
        if not json_jokes['error']:
            bot.send_message(call.message.chat.id, make_answer_string('Да вы ценитель иностранного юмора, lets go:',
                                                                      [ jk['joke'] for jk in json_jokes['jokes'] ] ),
                                                    reply_markup = get_inline_keyboard( f'api/category/{category}' ) )
        else:
            print("API saes error")
            bot.send_message(call.message.chat.id, make_answer_string('Что-то пошло не так 😭\n 🔧🔧🔧 Проблема уже решается 🔧🔧🔧\n\n пока давайте посмотрим на мои любимые анекдоты', find_jokes_in_file() ))
    except Exception as e:
        print("error with API:", e)
        bot.send_message(call.message.chat.id, make_answer_string('Что-то пошло не так 😭\n 🔧🔧🔧 Проблема уже решается 🔧🔧🔧\n\n пока давайте посмотрим на мои любимые анекдоты', find_jokes_in_file() ))



@bot.callback_query_handler(func=lambda call: call.data == 'lokal')
def callback_api_search(call: CallbackQuery) -> None:
    remove_inline_keyboard(call.message.chat.id, call.message.id)
    bot.send_message(call.message.chat.id, make_answer_string('💎Брильянтовые💎 анекдоты специально для вас:',
                                                              find_jokes_in_file()),
                                                              reply_markup = get_inline_keyboard('lokal'))



@bot.callback_query_handler(func=lambda call: call.data == 'gmenu')
def callback_make_menu(call: CallbackQuery) -> None:
    remove_inline_keyboard(call.message.chat.id, call.message.id)
    make_menu(call.message.chat.id)


if __name__ == "__main__":
    try:

        print("Bot started...")
        bot.infinity_polling(timeout=60, long_polling_timeout=60)

    except Exception as e:

        print("Polling error:", e)
